
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # github_repository.cursor has changed
  ~ resource "github_repository" "cursor" {
      ~ etag                        = "W/\"3b092513266eb230ac5d61cda48a9d54571183c9eebb29659bdc4f02aa2071e8\"" -> "W/\"e3ba651fe15fb2e0b4778d43ab8ca923a569d768bdf07c95ad2ecd858268e72f\""
        id                          = "template-cursor"
        name                        = "template-cursor"
      + primary_language            = "Makefile"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # github_branch_protection.default_branch["cursor"] will be created
  + resource "github_branch_protection" "default_branch" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_status_checks {
          + contexts = [
              + "pre-commit",
            ]
          + strict   = true
        }
    }

  # github_repository.cursor will be destroyed
  # (because github_repository.cursor is not in configuration)
  - resource "github_repository" "cursor" {
      - allow_auto_merge            = false -> null
      - allow_merge_commit          = true -> null
      - allow_rebase_merge          = true -> null
      - allow_squash_merge          = true -> null
      - allow_update_branch         = false -> null
      - archived                    = false -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = false -> null
      - description                 = "Cursor repository created from template" -> null
      - etag                        = "W/\"e3ba651fe15fb2e0b4778d43ab8ca923a569d768bdf07c95ad2ecd858268e72f\"" -> null
      - full_name                   = "surefirev2/template-cursor" -> null
      - git_clone_url               = "git://github.com/surefirev2/template-cursor.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = false -> null
      - has_issues                  = false -> null
      - has_projects                = false -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/surefirev2/template-cursor" -> null
      - http_clone_url              = "https://github.com/surefirev2/template-cursor.git" -> null
      - id                          = "template-cursor" -> null
      - is_template                 = false -> null
      - merge_commit_message        = "PR_TITLE" -> null
      - merge_commit_title          = "MERGE_MESSAGE" -> null
      - name                        = "template-cursor" -> null
      - node_id                     = "R_kgDOOiskBA" -> null
      - primary_language            = "Makefile" -> null
      - private                     = false -> null
      - repo_id                     = 975905796 -> null
      - squash_merge_commit_message = "COMMIT_MESSAGES" -> null
      - squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> null
      - ssh_clone_url               = "git@github.com:surefirev2/template-cursor.git" -> null
      - svn_url                     = "https://github.com/surefirev2/template-cursor" -> null
      - topics                      = [] -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = true -> null
      - web_commit_signoff_required = false -> null

      - security_and_analysis {

          - secret_scanning {
              - status = "disabled" -> null
            }

          - secret_scanning_push_protection {
              - status = "disabled" -> null
            }
        }

      - template {
          - include_all_branches = false -> null
          - owner                = "surefirev2" -> null
          - repository           = "template-template" -> null
        }
    }

  # github_repository.repos["cursor"] will be created
  + resource "github_repository" "repos" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "Cursor repository created from template"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = false
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "template-cursor"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + web_commit_signoff_required = false

      + security_and_analysis {
          + advanced_security {
              + status = (known after apply)
            }

          + secret_scanning {
              + status = (known after apply)
            }

          + secret_scanning_push_protection {
              + status = (known after apply)
            }
        }

      + template {
          + include_all_branches = false
          + owner                = "surefirev2"
          + repository           = "template-template"
        }
    }

Plan: 2 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  - repository_name  = "surefirev2/template-cursor" -> null
  + repository_names = {
      + cursor = (known after apply)
    }
  - repository_url   = "https://github.com/surefirev2/template-cursor" -> null
  + repository_urls  = {
      + cursor = (known after apply)
    }

<!-- Sticky Pull Request Commentterraform-plan -->